In [1]:
import pandas as pd

In [2]:
dict1 = {
    "marks":[10,20,30,14,69],
    "name":["bikon",'rajin','rifat','niam','fahim'],
    "location":['ganginarpar','kachijhuli','amc','amc','onekdure']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

   marks   name     location
0     10  bikon  ganginarpar
1     20  rajin   kachijhuli
2     30  rifat          amc
3     14   niam          amc
4     69  fahim     onekdure

In [5]:
df.to_csv('frends0.csv')

In [6]:
df.to_csv('friends2.csv',index=False)

In [7]:
df.head(2)

   marks   name     location
0     10  bikon  ganginarpar
1     20  rajin   kachijhuli

In [8]:
df.tail(2)

   marks   name  location
3     14   niam       amc
4     69  fahim  onekdure

In [9]:
df.describe()

           marks
count   5.000000
mean   28.600000
std    23.807562
min    10.000000
25%    14.000000
50%    20.000000
75%    30.000000
max    69.000000

In [10]:
df.max()

marks             69
name           rifat
location    onekdure
dtype: object

In [11]:
bikon =pd.read_csv('bikon.csv')

In [12]:
bikon

   Train No  Speed     Location
0        10     22  ganginarpar
1        20     33   kachijhuli
2        30     44          amc
3        14     55          amc
4        69     66     onekdure

In [13]:
bikon['Speed']

0    22
1    33
2    44
3    55
4    66
Name: Speed, dtype: int64

In [14]:
bikon['Speed'][1] = 99 #works_good

<ipython-input-14-162cb976d8b4>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bikon['Speed'][1] = 99 #works_good

In [15]:
bikon

   Train No  Speed     Location
0        10     22  ganginarpar
1        20     99   kachijhuli
2        30     44          amc
3        14     55          amc
4        69     66     onekdure

In [16]:
bikon.to_csv("bikon1.csv")

In [17]:
bikon.index =['first',"second","third","fouth","fifth"]

In [18]:
bikon

        Train No  Speed     Location
first         10     22  ganginarpar
second        20     99   kachijhuli
third         30     44          amc
fouth         14     55          amc
fifth         69     66     onekdure

In [19]:
import numpy as np

In [20]:
ser = pd.Series(np.random.rand(10))

In [21]:
ser

0    0.502171
1    0.444952
2    0.463531
3    0.779595
4    0.263553
5    0.190816
6    0.473028
7    0.494478
8    0.438616
9    0.417614
dtype: float64

In [22]:
type(ser)

pandas.core.series.Series

In [23]:
newdf=pd.DataFrame(np.random.rand(335,5),index=np.arange(335))

In [24]:
newdf

            0         1         2         3         4
0    0.127541  0.652214  0.720731  0.630563  0.650787
1    0.963910  0.003871  0.057987  0.780678  0.980098
2    0.033425  0.227662  0.187853  0.236797  0.155204
3    0.977362  0.165107  0.212846  0.464708  0.831627
4    0.939763  0.184261  0.331653  0.528041  0.876577
..        ...       ...       ...       ...       ...
330  0.981463  0.562064  0.678054  0.123620  0.339796
331  0.873695  0.198069  0.125585  0.693027  0.972645
332  0.570017  0.064618  0.401923  0.964643  0.453933
333  0.039209  0.881414  0.774347  0.273003  0.769068
334  0.564874  0.426052  0.172287  0.487250  0.697206

[335 rows x 5 columns]

In [25]:
newdf.head()

          0         1         2         3         4
0  0.127541  0.652214  0.720731  0.630563  0.650787
1  0.963910  0.003871  0.057987  0.780678  0.980098
2  0.033425  0.227662  0.187853  0.236797  0.155204
3  0.977362  0.165107  0.212846  0.464708  0.831627
4  0.939763  0.184261  0.331653  0.528041  0.876577

In [26]:
newdf.tail()

            0         1         2         3         4
330  0.981463  0.562064  0.678054  0.123620  0.339796
331  0.873695  0.198069  0.125585  0.693027  0.972645
332  0.570017  0.064618  0.401923  0.964643  0.453933
333  0.039209  0.881414  0.774347  0.273003  0.769068
334  0.564874  0.426052  0.172287  0.487250  0.697206

In [27]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            325, 326, 327, 328, 329, 330, 331, 332, 333, 334],
           dtype='int64', length=335)

In [28]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [29]:
newdf.describe()

                0           1           2           3           4
count  335.000000  335.000000  335.000000  335.000000  335.000000
mean     0.494228    0.494803    0.503271    0.487285    0.514254
std      0.277773    0.277361    0.278857    0.280031    0.284748
min      0.005104    0.003859    0.003806    0.003677    0.003204
25%      0.247878    0.244155    0.263309    0.250929    0.284999
50%      0.495802    0.519520    0.493911    0.487250    0.528225
75%      0.708448    0.736437    0.724439    0.697444    0.764603
max      0.999539    0.983975    0.999673    0.996913    0.998149

In [30]:
newdf.to_numpy()

array([[0.12754134, 0.65221418, 0.72073119, 0.63056283, 0.65078671],
       [0.96390964, 0.00387106, 0.05798707, 0.78067765, 0.98009771],
       [0.03342493, 0.22766151, 0.18785295, 0.23679701, 0.15520402],
       ...,
       [0.57001748, 0.06461825, 0.4019233 , 0.96464254, 0.45393277],
       [0.03920865, 0.88141355, 0.77434713, 0.27300256, 0.76906816],
       [0.56487383, 0.42605222, 0.17228691, 0.4872502 , 0.6972062 ]])

In [31]:
newdf.sort_index(axis=0,ascending=False) #row_sortng

            0         1         2         3         4
334  0.564874  0.426052  0.172287  0.487250  0.697206
333  0.039209  0.881414  0.774347  0.273003  0.769068
332  0.570017  0.064618  0.401923  0.964643  0.453933
331  0.873695  0.198069  0.125585  0.693027  0.972645
330  0.981463  0.562064  0.678054  0.123620  0.339796
..        ...       ...       ...       ...       ...
4    0.939763  0.184261  0.331653  0.528041  0.876577
3    0.977362  0.165107  0.212846  0.464708  0.831627
2    0.033425  0.227662  0.187853  0.236797  0.155204
1    0.963910  0.003871  0.057987  0.780678  0.980098
0    0.127541  0.652214  0.720731  0.630563  0.650787

[335 rows x 5 columns]

In [32]:
newdf.sort_index(axis=1,ascending=False) #columns_sorting

            4         3         2         1         0
0    0.650787  0.630563  0.720731  0.652214  0.127541
1    0.980098  0.780678  0.057987  0.003871  0.963910
2    0.155204  0.236797  0.187853  0.227662  0.033425
3    0.831627  0.464708  0.212846  0.165107  0.977362
4    0.876577  0.528041  0.331653  0.184261  0.939763
..        ...       ...       ...       ...       ...
330  0.339796  0.123620  0.678054  0.562064  0.981463
331  0.972645  0.693027  0.125585  0.198069  0.873695
332  0.453933  0.964643  0.401923  0.064618  0.570017
333  0.769068  0.273003  0.774347  0.881414  0.039209
334  0.697206  0.487250  0.172287  0.426052  0.564874

[335 rows x 5 columns]

In [33]:
newdf[0]

0      0.127541
1      0.963910
2      0.033425
3      0.977362
4      0.939763
         ...
330    0.981463
331    0.873695
332    0.570017
333    0.039209
334    0.564874
Name: 0, Length: 335, dtype: float64

In [34]:
type(newdf[0])

pandas.core.series.Series

In [35]:
newdf.loc[0,0]=567  #no

In [36]:
newdf #no

              0         1         2         3         4
0    567.000000  0.652214  0.720731  0.630563  0.650787
1      0.963910  0.003871  0.057987  0.780678  0.980098
2      0.033425  0.227662  0.187853  0.236797  0.155204
3      0.977362  0.165107  0.212846  0.464708  0.831627
4      0.939763  0.184261  0.331653  0.528041  0.876577
..          ...       ...       ...       ...       ...
330    0.981463  0.562064  0.678054  0.123620  0.339796
331    0.873695  0.198069  0.125585  0.693027  0.972645
332    0.570017  0.064618  0.401923  0.964643  0.453933
333    0.039209  0.881414  0.774347  0.273003  0.769068
334    0.564874  0.426052  0.172287  0.487250  0.697206

[335 rows x 5 columns]

In [37]:
newdf.head(3)

            0         1         2         3         4
0  567.000000  0.652214  0.720731  0.630563  0.650787
1    0.963910  0.003871  0.057987  0.780678  0.980098
2    0.033425  0.227662  0.187853  0.236797  0.155204

In [38]:
newdf.columns=["a","b","c","d","e"]  #newdf.columns=list("abcde") will also work

In [39]:
newdf.head()

            a         b         c         d         e
0  567.000000  0.652214  0.720731  0.630563  0.650787
1    0.963910  0.003871  0.057987  0.780678  0.980098
2    0.033425  0.227662  0.187853  0.236797  0.155204
3    0.977362  0.165107  0.212846  0.464708  0.831627
4    0.939763  0.184261  0.331653  0.528041  0.876577

In [40]:
newdf.loc[0,"a"]=987

In [41]:
newdf

              a         b         c         d         e
0    987.000000  0.652214  0.720731  0.630563  0.650787
1      0.963910  0.003871  0.057987  0.780678  0.980098
2      0.033425  0.227662  0.187853  0.236797  0.155204
3      0.977362  0.165107  0.212846  0.464708  0.831627
4      0.939763  0.184261  0.331653  0.528041  0.876577
..          ...       ...       ...       ...       ...
330    0.981463  0.562064  0.678054  0.123620  0.339796
331    0.873695  0.198069  0.125585  0.693027  0.972645
332    0.570017  0.064618  0.401923  0.964643  0.453933
333    0.039209  0.881414  0.774347  0.273003  0.769068
334    0.564874  0.426052  0.172287  0.487250  0.697206

[335 rows x 5 columns]

In [42]:
newdf = newdf.drop((0,0), axis=1)

KeyError: '[(0, 0)] not found in axis'

In [ ]:
newdf=newdf.drop((0,'a'),axis=1)

In [ ]:
newdf

In [ ]:
newdf.loc[[1,2],['c','d']]

In [ ]:
newdf.loc[:,['c','d']]

In [ ]:
newdf.loc[[1,2],:]

In [ ]:
newdf.loc[(newdf['a']<0.2)]

In [ ]:
newdf.loc[(newdf['a']<0.2) & (newdf['c']>0.1)]

In [ ]:
newdf.loc[(newdf['a']<0.2)].head(2)

In [ ]:
newdf.head(2)

In [ ]:
newdf.iloc[0,4]   #to_seacrh_with_exact_index

In [ ]:
newdf.iloc[[0,1],[0,2]]

In [ ]:
newdf.head(3)

In [ ]:
newdf.drop(0) #dropping row

In [ ]:
newdf.drop([0]) #dropping row

In [ ]:
newdf.drop('a',axis=1) #dropping column

In [ ]:
newdf.drop(['a','c'],axis=1) #dropping column

In [ ]:
newdf.drop(['b'],axis=1, inplace =True)  #modifies the original one

In [ ]:
newdf

In [ ]:
newdf=pd.DataFrame(np.random.rand(335,5),index=np.arange(335)).head(8)

In [ ]:
newdf

In [ ]:
newdf.drop([1,5],axis=0,inplace=True)   #deletes row no. 1 and 5

In [ ]:
newdf

In [ ]:
newdf.reset_index()  #brings back rows

In [ ]:
newdf.reset_index(drop = True, inplace=True) #removes the column named index

In [ ]:
newdf

In [ ]:
newdf[1].isnull() #to_find_what_values_are_null

In [ ]:
newdf.loc[:,[2]] = 55  #to make a column with custom values

In [ ]:
newdf

In [ ]:
x=pd.DataFrame(np.random.rand(10,5),index=np.arange(10))

In [46]:
import pandas as pd

In [50]:
df = pd.DataFrame({'name':['Alfred',' Batman', 'catwoman'],
                           'toy':[np.NaN,'batmobile','bullwhip'],
                           'born':[pd.NaT,pd.Timestamp('1940-04-25'),pd.NaT]})

In [51]:
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  batmobile 1940-04-25
2  catwoman   bullwhip        NaT

In [52]:
df.dropna()  #drops

      name        toy       born
1   Batman  batmobile 1940-04-25

In [ ]:
df.dropna(how =all )

In [56]:
df = pd.DataFrame({'name':['Alfred',' Batman', 'catwoman'],
                           'toy':[np.NaN,np.NaN,np.NaN],
                           'born':[pd.NaT,pd.Timestamp('1940-04-25'),pd.NaT]})

In [57]:
df

       name  toy       born
0    Alfred  NaN        NaT
1    Batman  NaN 1940-04-25
2  catwoman  NaN        NaT

In [60]:
df.dropna(how='all',axis =1)  #removes NaN values

       name       born
0    Alfred        NaT
1    Batman 1940-04-25
2  catwoman        NaT

In [66]:
df = pd.DataFrame({'name':['Alfred',' Batman', 'Alfred'],
                           'toy':[np.NaN,'batmobile','bullwhip'],
                           'born':[pd.NaT,pd.Timestamp('1940-04-25'),pd.NaT]})

In [67]:
df.drop_duplicates(subset ='name')  #removes duplicate from NAME

      name        toy       born
0   Alfred        NaN        NaT
1   Batman  batmobile 1940-04-25

In [69]:
df.drop_duplicates(subset =['name'],keep =False) #removes all duplicate values

      name        toy       born
1   Batman  batmobile 1940-04-25

In [71]:
df.drop_duplicates(subset =['name'],keep ='last') #keeps the last duplicate one

      name        toy       born
1   Batman  batmobile 1940-04-25
2   Alfred   bullwhip        NaT

In [74]:
df.drop_duplicates(subset =['name'],keep ='first') #keeps the first duplicate record

      name        toy       born
0   Alfred        NaN        NaT
1   Batman  batmobile 1940-04-25

In [77]:
df.shape

(3, 3)

In [78]:
df.info

<bound method DataFrame.info of       name        toy       born
0   Alfred        NaN        NaT
1   Batman  batmobile 1940-04-25
2   Alfred   bullwhip        NaT>

In [81]:
df['name'].value_counts(dropna =False)

Alfred     2
 Batman    1
Name: name, dtype: int64

In [82]:
df['toy'].value_counts(dropna =True)

bullwhip     1
batmobile    1
Name: toy, dtype: int64

In [83]:
df.notnull()

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False

In [84]:
df.std()

born   NaT
dtype: timedelta64[ns]

In [ ]:
 data = pd.read_excel('data.xlxs')   #reads excel files

In [ ]:
 data = pd.read_excel('data.xlxs',sheet_name = 'sheet2') #reads excel files and sheets

In [ ]:
data.iloc[0,0] =34  #changes value

In [ ]:
data.to_excel('data.xlxs',sheet_name = 'sheet2') #writes excel file.Here it will put 34 at [0,0]